Visualization/src/XmlaEngine/log/read22.txt

Read:0
================================================================================
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><Execute xmlns="urn:schemas-microsoft-com:xml-analysis"><Command><Statement>SELECT CrossJoin({[Measures].[store_sales], [Measures].[store_cost], [Measures].[unit_sales]}, {[time].[1997], [time].[1998]}) ON columns, Hierarchize(Union(Union(Union(CrossJoin({[cust].[Allcusts]}, {[store].[All stores]}), CrossJoin({[cust].[Allcusts]}, [store].[All stores].Children)), CrossJoin([cust].[Allcusts].Children, {[store].[All stores]})), CrossJoin([cust].[Allcusts].[Mexico].Children, {[store].[All stores]}))) ON rows FROM mySales</Statement></Command><Properties><PropertyList><AxisFormat>TupleFormat</AxisFormat><Format>Multidimensional</Format><Catalog>test</Catalog><DataSourceInfo>Local Analysis Server</DataSourceInfo></PropertyList></Properties></Execute></SOAP-ENV:Body></SOAP-ENV:Envelope>
